---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunWidthTooLongFailure
source: html/145f5aa0-f034-f6d6-62f4-ea9a039aa15e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ArcRunWidthTooLongFailure Property

Arc run width is too long.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArcRunWidthTooLongFailure { get; }
```